Documents/ОтправкаПеремещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОтправкаПеремещений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтправкаИнвойсов</xr:Item>
				<xr:Item>InformationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОтгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПеревозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступленияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступленияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТоварныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварнаяГруппаПеревозчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварныеГруппыПеревозчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаAWB</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИнвойс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварнаяГруппаПеревозчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварныеГруппыПеревозчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗатратыДоп</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РегистраторыЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СостоянияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнспекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплатыАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыИнвойса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыИнвойса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноПрибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Перемещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Перемещение</Name>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтправкаПеремещений/Ext/ManagerModule.bsl
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	Возврат Новый Структура("Отправка, ПакингЛист, Отгрузки, Вес, Прибытие, ЗатратыПоГруппам", 
							НСтр("ru='Отправка';en='Shipment'"), 
							НСтр("ru='Пакинг лист';en='Packing list'"), 
							НСтр("ru='Отгрузки';en='Shipments'"),
							НСтр("ru='Контроль веса';en='Weight'"), 
							НСтр("ru='Прибытие';en='Arrival'"),
							НСтр("ru='Затраты по товарным группам';en='Costs by product group'")
							);		

КонецФункции 

Процедура ПечатьДокумента(ДокСсылка, ВариантПечатнойФормы, ТабДокумент, Параметры = 0) Экспорт
	
	Если НЕ (РольДоступна("Администратор") ИЛИ 
			РольДоступна("Логистика") ИЛИ 
			РольДоступна("Бухгалтерия") ИЛИ 
			РольДоступна("Менеджер") ИЛИ 
			РольДоступна("МетреонПолный") ИЛИ 
			РольДоступна("МетреонЛогистика") ИЛИ
			РольДоступна("ПросмотрДокументаОтправка")) Тогда 
		Сообщить(НСтр("ru = 'Недостаточно прав!'; en = 'Not enough rights!'"));
		Возврат;
	КонецЕсли;
	
	СкрытьЦены = (РольДоступна("Менеджер") ИЛИ РольДоступна("ПросмотрДокументаОтправка"))
				И НЕ РольДоступна("ВидимостьНаценки")
				И НЕ РольДоступна("Администратор");
	
	ТабДокумент.Очистить();
	Макет = Документы.ОтправкаПеремещений.ПолучитьМакет(ВариантПечатнойФормы);
	
	ЗапросШ = Новый Запрос;
	ЗапросШ.УстановитьПараметр("Ссылка", ДокСсылка);
	ЗапросШ.УстановитьПараметр("ПредставлениеДокумента",  ОбщегоНазначения.ПредставлениеДокументаДляПечати(ДокСсылка, ПолучитьСтруктуруПечатныхФорм()[ВариантПечатнойФормы]));
	ЗапросШ.Текст = "ВЫБРАТЬ
	               |	Отправка.Номер,
	               |	Отправка.Дата,
	               |	Отправка.НомерОтгрузки,
	               |	Отправка.Перевозчик,
	               |	Отправка.Вес,
	               |	Отправка.Мест,
	               |	Отправка.Количество,
	               |	Отправка.ТипПеревозки,
	               |	Отправка.ДатаПоступленияПлан,
	               |	Отправка.ДатаПоступленияФакт,
	               |	Отправка.СкладОтправитель,
	               |	ВЫРАЗИТЬ(Отправка.Примечание КАК СТРОКА(1000)) КАК Примечание,
	               |	&ПредставлениеДокумента КАК ПредставлениеДокумента
	               |ИЗ
	               |	Документ.ОтправкаПеремещений КАК Отправка
	               |ГДЕ
	               |	Отправка.Ссылка = &Ссылка";
	Шапка = ЗапросШ.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ТекстЗапросаТовары = "ВЫБРАТЬ
	                     |	Свод.Номенклатура КАК Номенклатура,
	                     |	Свод.Инвойс КАК Инвойс,
	                     |	Свод.НомерИнвойса КАК НомерИнвойса,
	                     |	Свод.Поставщик КАК Поставщик,
	                     |	Свод.Псевдоним КАК Псевдоним,
	                     |	Свод.Количество КАК Количество,
	                     |	Свод.Сумма КАК Сумма
	                     |ПОМЕСТИТЬ ТЗ
	                     |ИЗ
	                     |	(ВЫБРАТЬ
	                     |		ПеремещениеТовары.Номенклатура КАК Номенклатура,
	                     |		ПеремещениеТовары.Партия.Док.ВКД_Инвойс КАК Инвойс,
	                     |		ПеремещениеТовары.Партия.Док.ВКД_Инвойс.ВКД_НомерИнвойсаПоставщика КАК НомерИнвойса,
	                     |		ПеремещениеТовары.Партия.Док.ВКД_Инвойс.Контрагент КАК Поставщик,
	                     |		ПеремещениеТовары.Партия.Док.ВКД_Инвойс.Контрагент.Псевдоним КАК Псевдоним,
	                     |		ПеремещениеТовары.Количество КАК Количество,
	                     |		ВЫБОР
	                     |			КОГДА &СкрытьЦены
	                     |				ТОГДА 0
	                     |			ИНАЧЕ ПеремещениеТовары.СуммаЗакупки
	                     |		КОНЕЦ КАК Сумма
	                     |	ИЗ
	                     |		Документ.Перемещение.Товары КАК ПеремещениеТовары
	                     |	ГДЕ
	                     |		ПеремещениеТовары.Ссылка В
	                     |				(ВЫБРАТЬ
	                     |					ТЧ.ТоварныйДокумент
	                     |				ИЗ
	                     |					Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ТЧ
	                     |				ГДЕ
	                     |					ТЧ.Ссылка = &Ссылка)
	                     |	
	                     |	ОБЪЕДИНИТЬ ВСЕ
	                     |	
	                     |	ВЫБРАТЬ
	                     |		РНТовары.Номенклатура,
	                     |		РНТовары.Партия.Док.ВКД_Инвойс,
	                     |		РНТовары.Партия.Док.ВКД_Инвойс.ВКД_НомерИнвойсаПоставщика,
	                     |		РНТовары.Партия.Док.ВКД_Инвойс.Контрагент,
	                     |		РНТовары.Партия.Док.ВКД_Инвойс.Контрагент.Псевдоним,
	                     |		РНТовары.Количество,
	                     |		ВЫБОР
	                     |			КОГДА &СкрытьЦены
	                     |				ТОГДА 0
	                     |			ИНАЧЕ РНТовары.СуммаЗакупки
	                     |		КОНЕЦ
	                     |	ИЗ
	                     |		Документ.РасходнаяНакладная.Товары КАК РНТовары
	                     |	ГДЕ
	                     |		РНТовары.Ссылка В
	                     |				(ВЫБРАТЬ
	                     |					ТЧ.ТоварныйДокумент
	                     |				ИЗ
	                     |					Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ТЧ
	                     |				ГДЕ
	                     |					ТЧ.Ссылка = &Ссылка)) КАК Свод";
	ТекстЗапросаТовары = ТекстЗапросаТовары + "; ";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("СкрытьЦены", СкрытьЦены);
	
	Если ВариантПечатнойФормы = "Отправка" Тогда

		Запрос.Текст = ТекстЗапросаТовары + "ВЫБРАТЬ
		               |	ТЗ.Номенклатура КАК Номенклатура,  
					   |	ТЗ.Номенклатура.Вес КАК Вес,
		               |	СУММА(ТЗ.Количество) КАК Количество,
		               |	СУММА(ТЗ.Сумма) КАК Сумма,
		               |	среднее(ТЗ.Сумма / ТЗ.Количество) КАК Цена,
 						|	СУММА(ТЗ.Количество) * ТЗ.Номенклатура.Вес / 1000 КАК ИтВес
 						|ИЗ ТЗ      
					   |
					   |  Сгруппировать по ТЗ.Номенклатура,
					   |  ТЗ.Номенклатура.Вес
					   |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТЗ.Номенклатура.Наименование
		               |ИТОГИ
		               |	СУММА(Количество),
		               |	СУММА(Сумма), 
					   |	Среднее(Цена),
					   |	Среднее(Вес), 
					   |	Сумма(ИтВес)
		               |ПО Общие,
		               |	Номенклатура ИЕРАРХИЯ"; 
		
		глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка);

		Итоги = Запрос.Выполнить().Выбрать();
		Итоги.Следующий();

		ОбластьДно = Макет.ПолучитьОбласть("Дно");
		ОбластьДно.Параметры.Заполнить(Шапка);  
		ОбластьДно.Параметры.Сумма 		= Итоги.Сумма;
		ОбластьДно.Параметры.Количество = Итоги.Количество;
		ОбластьДно.Параметры.ИтВес 		= Итоги.ИтВес;

		Итоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Номенклатура");
		ТабДокумент.НачатьАвтогруппировкуСтрок();
		ВыбратьЭлементыВИерархии(Итоги, Макет, ТабДокумент); 
		ТабДокумент.ЗакончитьАвтогруппировкуСтрок();

		ТабДокумент.Вывести(ОбластьДно);
		
	ИначеЕсли ВариантПечатнойФормы = "Прибытие" Тогда	

		Запрос.Текст = ТекстЗапросаТовары + "ВЫБРАТЬ
						|	ВЫБОР
						|		КОГДА СостоянияИнвойсов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнвойса.Прибыл)
						|			ТОГДА ИСТИНА
						|		ИНАЧЕ ЛОЖЬ
						|	КОНЕЦ КАК Прибыл,
						|	ТЗ.Номенклатура КАК Номенклатура,
						|	СУММА(ТЗ.Количество) КАК Количество,
						|	СУММА(ТЗ.Сумма) КАК Сумма,
						|	СРЕДНЕЕ(ТЗ.Сумма / ТЗ.Количество) КАК Цена
						|ИЗ
						|	ТЗ КАК ТЗ
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
						|		ПО ТЗ.Инвойс = СостоянияИнвойсов.Инвойс
						|
						|СГРУППИРОВАТЬ ПО
						|	ВЫБОР
						|		КОГДА СостоянияИнвойсов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнвойса.Прибыл)
						|			ТОГДА ИСТИНА
						|		ИНАЧЕ ЛОЖЬ
						|	КОНЕЦ,
						|	ТЗ.Номенклатура
						|УПОРЯДОЧИТЬ ПО
						|	ТЗ.Номенклатура.Наименование
						|ИТОГИ
						|	СУММА(Количество),
						|	СУММА(Сумма),
						|	СРЕДНЕЕ(Цена)
						|ПО
						|	ОБЩИЕ,
						|	Прибыл,
						|	Номенклатура ИЕРАРХИЯ";  
		
		глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка);
		
		ОбластьСтатус = Макет.ПолучитьОбласть("Статус");

		ВыборкаИт = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаИт.Следующий();   
		ОбластьДно = Макет.ПолучитьОбласть("Дно");
		ОбластьДно.Параметры.Заполнить(ВыборкаИт);
		
		ВыборкаС = ВыборкаИт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//ТабДокумент.НачатьАвтогруппировкуСтрок();
		Пока ВыборкаС.Следующий() Цикл  

			ОбластьСтатус.Параметры.Заполнить(ВыборкаС);
			ОбластьСтатус.Параметры.Статус = ?(ВыборкаС.Прибыл, "Прибыл", "НЕ прибыл");
			ТабДокумент.Вывести(ОбластьСтатус);   
			
			т = ВыборкаС.Выбрать();
			ТабДокумент.НачатьАвтогруппировкуСтрок();
			ВыбратьЭлементыВИерархии(т, Макет, ТабДокумент); 
			ТабДокумент.ЗакончитьАвтогруппировкуСтрок();   

		КонецЦикла;	
		//	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
		
		ТабДокумент.Вывести(ОбластьДно);
		
	ИначеЕсли ВариантПечатнойФормы = "ПакингЛист" Тогда	

		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка); 
		ТабДокумент.Вывести(ОбластьМакета);
		
		Запрос.Текст = ТекстЗапросаТовары +
					"ВЫБРАТЬ
					|	Свод.Инвойс КАК Инвойс,
					|	Свод.Инвойс.Валюта.Символ КАК Валюта,
					|	Свод.НомерИнвойса,
					|	Свод.Поставщик,
					|	Свод.Псевдоним,
					|	Свод.Номенклатура КАК Товар,
					|	Свод.Количество КАК Количество,
					|	Свод.Сумма КАК Сумма,
					|	Свод.Сумма / Свод.Количество КАК Цена
					|ИЗ ТЗ КАК Свод
					|ИТОГИ
					|	СУММА(Количество),
					|	СУММА(Сумма)
					|ПО
					|	ОБЩИЕ,
					|	Инвойс,
					|	Товар
					|АВТОУПОРЯДОЧИВАНИЕ";
		
		РезультатЗапроса = Запрос.Выполнить();
		Выгрузка = РезультатЗапроса.Выгрузить();
		ВыборкаИт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаИт.Следующий();   
		ОбластьДно = Макет.ПолучитьОбласть("Дно");
		ОбластьДно.Параметры.Заполнить(ВыборкаИт);
					   
		ОбластьИнвойс 	= Макет.ПолучитьОбласть("Инвойс");
		ОбластьТовар 	= Макет.ПолучитьОбласть("Товар");
		//ОбластьИтог 	= Макет.ПолучитьОбласть("Итог");
		
		ВыборкаИ = ВыборкаИт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИ.Следующий() Цикл    
			ОбластьИнвойс.Параметры.Заполнить(ВыборкаИ);
			ВыборкаТ = ВыборкаИ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаТ.Следующий() Цикл 
				//ОбластьТовар.Параметры.Заполнить(ВыборкаТ);
				//ТабДокумент.Вывести(ОбластьТовар);
				выб = ВыборкаТ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока Выб.Следующий() Цикл   
					ОбластьИнвойс.Параметры.Инвойс			= Выб.Инвойс;
					ОбластьИнвойс.Параметры.НомерИнвойса    = Выб.НомерИнвойса;
					ОбластьИнвойс.Параметры.Поставщик       = Выб.Поставщик;
					ОбластьИнвойс.Параметры.Псевдоним       = Выб.Псевдоним;
					ОбластьИнвойс.Параметры.Валюта       	= Выб.Валюта;
				КонецЦикла;
			КонецЦикла;
			ТабДокумент.Вывести(ОбластьИнвойс);   
			
			ВыборкаТ = ВыборкаИ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаТ.Следующий() Цикл 
				ОбластьТовар.Параметры.Заполнить(ВыборкаТ);
				ОбластьТовар.Параметры.Цена       			= ОбластьТовар.Параметры.Сумма / ОбластьТовар.Параметры.Количество;
				ТабДокумент.Вывести(ОбластьТовар);
			КонецЦикла;

		КонецЦикла;	

		//ТабДокумент.Вывести(ОбластьИтог);

		ТабДокумент.Вывести(ОбластьДно);
		
	ИначеЕсли ВариантПечатнойФормы = "Отгрузки" Тогда	
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);

		Запрос.Текст = ТекстЗапросаТовары + 
						"ВЫБРАТЬ
						|	ТЗ.Инвойс,
						|	ТЗ.Поставщик,
						|	ТЗ.НомерИнвойса КАК НомерИнвойса,
						|	ТЗ.ДатаЗакупки,
						|	СУММА(ТЗ.Количество) КАК Количество,
						|	СУММА(ТЗ.Сумма) КАК Сумма,
						|	ТЗ.Валюта КАК Символ
						|ИЗ
						|	ТЗ КАК ТЗ
						|
						|СГРУППИРОВАТЬ ПО
						|	ТЗ.Инвойс,
						|	ТЗ.Поставщик,
						|	ТЗ.НомерИнвойса,
						|	ТЗ.ДатаЗакупки,
						|	ТЗ.Валюта
						|
						|УПОРЯДОЧИТЬ ПО
						|	НомерИнвойса
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	СУММА(ТЗ.Количество) КАК Количество,
						|	СУММА(ТЗ.Сумма) КАК Сумма,
						|	ТЗ.Валюта КАК Валюта
						|ИЗ
						|	ТЗ КАК ТЗ
						|
						|СГРУППИРОВАТЬ ПО
						|	ТЗ.Валюта"; 
		Пакет =  Запрос.ВыполнитьПакет();
        ВыборкаИ = Пакет[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		Пока ВыборкаИ.Следующий() Цикл 
			ОбластьСтрока.Параметры.Заполнить(ВыборкаИ);  
			ОбластьСтрока.Параметры.ДатаОтгрузки = Шапка.ДатаПоступленияПлан;
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		Выгрузка = Пакет[2].Выгрузить();
		ОбластьМакета = Макет.ПолучитьОбласть("Итог"); 
		Если Выгрузка.Количество() > 1 Тогда
			Для каждого СтрокаИт Из Выгрузка Цикл
				ОбластьМакета.Параметры.Заполнить(СтрокаИт); 
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			ОбластьМакета.Параметры.Валюта 		= НСтр("ru = 'ВСЕГО'; en = 'TOTAL'");
			ОбластьМакета.Параметры.Сумма 		= "";
			ОбластьМакета.Параметры.Символ 		= "";
			ОбластьМакета.Параметры.Количество 	= Выгрузка.Итог("Количество");
			ТабДокумент.Вывести(ОбластьМакета);
		Иначе
			ОбластьМакета.Параметры.Заполнить(Выгрузка[0]);
			ОбластьМакета.Параметры.Валюта 		= НСтр("ru = 'ВСЕГО'; en = 'TOTAL'");  
			ОбластьМакета.Параметры.Символ 		= Выгрузка[0].Валюта;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Дно");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);
	
	ИначеЕсли ВариантПечатнойФормы = "Вес" Тогда

		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);

		Запрос.Текст = ТекстЗапросаТовары + "ВЫБРАТЬ различные
		                                    |	ТЗ.Номенклатура КАК Номенклатура,
		                                    |	ТЗ.Номенклатура.Вес КАК Вес,
		                                    |	СУММА(ТЗ.Количество) КАК Количество,
		                                    |	СУММА(ТЗ.Количество) * ТЗ.Номенклатура.Вес КАК ИтВес
		                                    |ИЗ
		                                    |	ТЗ КАК ТЗ
		                                    |
		                                    |СГРУППИРОВАТЬ ПО
		                                    |	ТЗ.Номенклатура,
		                                    |	ТЗ.Номенклатура.Вес
		                                    |
		                                    |УПОРЯДОЧИТЬ ПО
		                                    |	Номенклатура.Наименование";
		Выборка = Запрос.Выполнить().Выбрать();
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		Пока Выборка.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла; 
		
	ИначеЕсли ВариантПечатнойФормы = "ЗатратыПоГруппам" Тогда
		
		Запрос.УстановитьПараметр("Пусто", Справочники.ГруппыПодбораНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("НетГруппыПодбора", НСтр("ru = '<группа подбора не определена>'; en = '<selection group not defined>'"));
		Запрос.Текст = ТекстЗапросаТовары + "ВЫБРАТЬ  
			|	ВЫБОР
			|		КОГДА ТЗ.Номенклатура.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.ГруппаПодбора
			|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.ГруппаПодбора
			|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.ГруппаПодбора
			|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
			|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
			|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
			|		Иначе &НетГруппыПодбора
			|	КОНЕЦ КАК ТоварнаяГруппа,
			|	ТЗ.Инвойс КАК Инвойс,
			|	ТЗ.Номенклатура КАК Номенклатура,  
			//+
			|	ТЗ.Номенклатура.Вес КАК ВесЕд, 
			//-
			|	СУММА(ТЗ.Количество) КАК Количество,
			|	СУММА(ТЗ.Сумма) КАК Сумма,   
			|	СУММА(ТЗ.Сумма/ТЗ.Количество) КАК Цена
			//|	СРЕДНЕЕ(ТЗ.Сумма / ТЗ.Количество) КАК Цена
			|ПОМЕСТИТЬ тзОтправки
			|ИЗ
			|	ТЗ КАК ТЗ
			|
			|СГРУППИРОВАТЬ ПО
			|	ТЗ.Инвойс,
			|	ВЫБОР
			|		КОГДА ТЗ.Номенклатура.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.ГруппаПодбора
			|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.ГруппаПодбора
			|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.ГруппаПодбора
			|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
			|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
			|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
			|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
			|		Иначе &НетГруппыПодбора
			|	КОНЕЦ,
			|	ТЗ.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	тзОтправки.ТоварнаяГруппа КАК ТоварнаяГруппа,
			|	тзОтправки.Инвойс КАК Инвойс,
			|	тзОтправки.Номенклатура КАК Номенклатура,  
			|	тзОтправки.ВесЕд КАК ВесЕд,    
			|	тзОтправки.Количество КАК Количество,
			|	тзОтправки.Сумма КАК Сумма,
			|	тзОтправки.Цена КАК Цена,
			|	ОтправкаРаспределениеЗатрат.Количество КАК КоличествоЗатрат,
			//|	ОтправкаРаспределениеЗатрат.Цена КАК ЦенаЗатрат,
			|	ОтправкаРаспределениеЗатрат.Цена КАК ЦенаЗатрат,
			|	ОтправкаРаспределениеЗатрат.Вес КАК Вес,
			//|   ОтправкаРаспределениеЗатрат.Сумма * тзОтправки.Количество/ОтправкаРаспределениеЗатрат.Количество КАК СуммаЗатрат
			|   (ОтправкаРаспределениеЗатрат.Сумма + ОтправкаРаспределениеЗатрат.СуммаAWB + ОтправкаРаспределениеЗатрат.СуммаИнвойс)* тзОтправки.Количество/ОтправкаРаспределениеЗатрат.Количество КАК СуммаЗатрат
			|ИЗ
			|	тзОтправки КАК тзОтправки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|							ОтправкаРаспрЗатрат.Номенклатура КАК Номенклатура,
			|							среднее(ОтправкаРаспрЗатрат.Количество) КАК Количество,
			|							СУММА(ОтправкаРаспрЗатрат.Цена) КАК Цена,
			|							среднее(ОтправкаРаспрЗатрат.Вес) КАК Вес,
			|							СУММА(ОтправкаРаспрЗатрат.Сумма) КАК Сумма,
			|							СУММА(ОтправкаРаспрЗатрат.СуммаAWB) КАК СуммаAWB,
			|							СУММА(ОтправкаРаспрЗатрат.СуммаИнвойс) КАК СуммаИнвойс
			|						ИЗ
			|							Документ.ОтправкаПеремещений.РаспределениеЗатрат КАК ОтправкаРаспрЗатрат
			|						ГДЕ
			|							ОтправкаРаспрЗатрат.Ссылка = &Ссылка
			|						СГРУППИРОВАТЬ ПО
			|							ОтправкаРаспрЗатрат.Номенклатура) КАК ОтправкаРаспределениеЗатрат
			|		ПО тзОтправки.Номенклатура = ОтправкаРаспределениеЗатрат.Номенклатура
			|ИТОГИ
			|	СУММА(Количество),
			|	СУММА(Сумма),
			//|	СРЕДНЕЕ(Цена),
			|	СУММА(Цена),
			|	СУММА(КоличествоЗатрат),
			|	СРЕДНЕЕ(ЦенаЗатрат),
			|	СУММА(Вес),    
			|	СРЕДНЕЕ(ВесЕд),
			|	СУММА(СуммаЗатрат)
			|ПО
			|	ОБЩИЕ,
			|	Инвойс,
			|	ТоварнаяГруппа,
			|	Номенклатура"; 
		
		глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка);
		
		//+
		ВыборкаИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
		ВыборкаИтог.Следующий();
		ОбластьДно = Макет.ПолучитьОбласть("Дно");
        ОбластьДно.Параметры.Заполнить(ВыборкаИтог);
		//-
		
		ТабДокумент.НачатьАвтогруппировкуСтрок();
		//Инв = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Инвойс");
		Инв = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Инв.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Инвойс");
			ОбластьМакета.Параметры.Заполнить(Инв);
			ТабДокумент.Вывести(ОбластьМакета, 1);
			Грп = Инв.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Грп.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("Группа");
				ОбластьМакета.Параметры.Заполнить(Грп);
				ТабДокумент.Вывести(ОбластьМакета, 2);
				Ном = Грп.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока Ном.Следующий() Цикл
					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка");
					ОбластьМакета.Параметры.Заполнить(Ном);
					//ОбластьМакета.Рисунки.D1.Картинка = 
					ТабДокумент.Вывести(ОбластьМакета, 3);
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		ТабДокумент.ЗакончитьАвтогруппировкуСтрок();

		//ОбластьДно.Параметры.Заполнить(Шапка);  
		//ОбластьДно.Параметры.Сумма = Итоги.Сумма;
		//ОбластьДно.Параметры.Количество = Итоги.Количество;
		ТабДокумент.Вывести(ОбластьДно);
		
	КонецЕсли;

КонецПроцедуры	

Процедура ВыбратьЭлементыВИерархии(ВыборкаСИерархией, Макет, ТабДокумент) 
	
	Пока ВыборкаСИерархией.Следующий() Цикл   
		
		Уровень = ВыборкаСИерархией.Номенклатура.Уровень();
		Если ВыборкаСИерархией.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда  
			
			ОбластьМакета = Макет.ПолучитьОбласть("Группа");
			ОбластьМакета.Параметры.Заполнить(ВыборкаСИерархией);
			ТабДокумент.Вывести(ОбластьМакета, Уровень);
			
			ВыбратьЭлементыВИерархии (ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Номенклатура"), Макет, ТабДокумент);
			
		ИначеЕсли ВыборкаСИерархией.ТипЗаписи() = ТипЗаписиЗапроса. ДетальнаяЗапись Тогда

			ОбластьМакета =  Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(ВыборкаСИерархией); 
			ТабДокумент.Вывести(ОбластьМакета, Уровень);
			
		КонецЕсли; 
		
	КонецЦикла;    
	
КонецПроцедуры
